"""
Name: {Puriwat Lertkrai}
SID: {11111111111}
Group: {MIT431}
"""

# ประกาศตัวแปร x มีค่าเท่ากับ 100
x =100
# แสดงผลค่าตัวแปร x
print(x)
# แสดงชนิดข้อมูลของตัวแปร x
print(type(x))

# ประกาศตัวแปร  y มีค่าเท่ากับ 200
y = 200
# แสดงผลค่าตัวแปร y
# แสดงผลค่าตัวแปร y
print(type(y))
# แสดงชนิดข้อมูลของตัวแปร y 

# แสดงผลค่าตัวแปร x และ y โดยมีข้อความดังนี้  "x is 100 and y is 200" 

# หาผลรวมของตัวแปร x และ y และเก็บไว้ในตัวแปร z
# แสดงผลค่าตัวแปร z โดยการใช้ formatted print  -- > print(f{...})

# หาผลลบของตัวแปร x และ y และเก็บไว้ในตัวแปร z
# แสดงผลค่าตัวแปร z formatted print  -- > print(f{...})

# หาผลคูณของตัวแปร x และ y และเก็บไว้ในตัวแปร z
# แสดงผลค่าตัวแปร z formatted print  -- > print(f{...})

# หาผลหารของตัวแปร x และ y และเก็บไว้ในตัวแปร z
# แสดงผลค่าตัวแปร z formatted print  -- > print(f{...})

# หาผลหารแบบจำนวนเต็ม (floor division) ของตัวแปร x และ y และเก็บไว้ในตัวแปร z
# แสดงผลค่าตัวแปร z formatted print  -- > print(f{...})

